## Plan Result (netbox_ptl)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.app-proxy-ga-service-connection-secret-management




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-secret-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-secret-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad693c4-36ad-468f-94e9-76faa4bc844b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/netbox-ptl-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* remove labels: Get &#34;https://api.github.com/repos/hmcts/rdo-netbox/issues/36/labels?per_page=100&#34;: dial tcp 140.82.121.5:443: i/o timeout
* add a label netbox_ptl/add-or-update: Post &#34;https://api.github.com/repos/hmcts/rdo-netbox/issues/36/labels&#34;: dial tcp 140.82.121.5:443: i/o timeout
<!-- github-comment: {"Command":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"","Target":"netbox_ptl","Vars":{}} -->